[
    {
      "category": "Music",
      "events": [
        { "id": "1.1", "name": "Bars Mayhem", "description": "Bars Mayhem is a dynamic hip-hop rap contest where participants will showcase their rap talent with crazy flow and lyrics." },
        { "id": "1.2", "name": "Rockmania", "description": "Rockmania, the ultimate musical showdown hosted by Advaita, brings together bands from colleges for a spectacular display of talent." },
        { "id": "1.3", "name": "Beatbrawl", "description": "Beatbrawl is an electrifying beatboxing competition embracing rhythm, creativity, and vocal percussion skills." },
        { "id": "1.4", "name": "Mridang", "description": "Mridang is a solo instrumental performance event for displaying instrumental talent from various categories." },
        { "id": "1.5", "name": "Reverb", "description": "Reverb is an enchanting western solo singing competition for vocalists to explore western music." },
        { "id": "1.6", "name": "Aaroh", "description": "Aaroh is a solo Indian classical singing event to showcase Indian compositions with focus on vocal skill and emotional expression." }
      ]
    },
    {
      "category": "Dance",
      "events": [
        { "id": "2.1", "name": "Chandrakala", "description": "Chandrakala is a solo dance competition celebrating classical and folk-dance traditions." },
        { "id": "2.2", "name": "Nrityakala", "description": "Nrityakala is a group dance competition celebrating the diversity of Indian Classical and Folk dances." },
        { "id": "2.3", "name": "Groove Wars", "description": "Groove Wars is a group dance competition blending modern western dance styles like hip-hop and jazz." },
        { "id": "2.4", "name": "Beatblitz", "description": "BeatBlitz is a solo western dance showdown featuring contemporary, hip-hop, and jazz choreography." },
        { "id": "2.5", "name": "Rhythemic Rebels", "description": "Rhythemic Rebels is a captivating duo dance competition showcasing coordination and dynamic interplay." },
        { "id": "2.6", "name": "Freestyle Frenzy", "description": "Freestyle Frenzy is a freestyle dance battle featuring raw talent, creativity, and unbounded energy." },
        { "id": "2.7", "name": "Kala Sangam", "description": "Kala Sangam is a duet fusion dance competition combining two classical/folk dance styles in one performance." }
      ]
    },
    {
      "category": "Drama",
      "events": [
        { "id": "3.1", "name": "Isharo Isharo Mein", "description": "Ishaaro Ishaaro Mein is an enthralling mime competition where silence speaks louder than words." },
        { "id": "3.2", "name": "Improov Leela", "description": "Improv Leela is a spontaneous acting competition where teams engage in on-the-spot battles of wit and humor." },
        { "id": "3.3", "name": "Aagaaz", "description": "Aagaaz is a Nukkad Natak competition for delivering impactful messages through energetic dialogues and expressive actions." },
        { "id": "3.4", "name": "Abhinay", "description": "Abhinay is a solo performance event where participants narrate stories through captivating acting." },
        { "id": "3.5", "name": "Rangmanch", "description": "Rangmanch is about showcasing creative stories and exceptional acting with original or established plays." }
      ]
    },
    {
      "category": "Art",
      "events": [
        { "id": "4.1", "name": "Mandala Art", "description": "Mandala Art is a competition showcasing intricate and mesmerizing mandalas designed by participants." },
        { "id": "4.2", "name": "Portraits Unplugged", "description": "Portraits Unplugged is a live sketching competition focused on capturing human emotions and character." },
        { "id": "4.3", "name": "Sketching Competition", "description": "Sketching Competition challenges participants to craft meaningful sketches based on a theme." },
        { "id": "4.4", "name": "Doodling", "description": "Doodling is a competition where participants create compelling stories through simple doodles." },
        { "id": "4.5", "name": "Fusion Frames", "description": "Fusion Frames is a mixed medium art competition where participants blend traditional mediums to create unique artwork." }
      ]
    },
    {
      "category": "Fashion",
      "events": [
        { "id": "5.1", "name": "Supernova", "description": "Supernova is a fashion show where fashion teams compete, showcasing breathtaking designs, stunning models, and spectacular performances." },
        { "id": "5.2", "name": "Mr and Ms Uphoria", "description": "Mr and Ms Uphoria is a talent and beauty competition promoting youth in dance, singing, mimicking, modelling, and more." }
      ]
    },
    {
      "category": "Gaming",
      "events": [
        { "id": "6.1", "name": "Bgmi Showdown", "description": "Bgmi Showdown is a thrilling BGMI tournament where teams compete for the championship title." },
        { "id": "6.2", "name": "Iron Fist Championship", "description": "Iron Fist Championship is a Tekken tournament testing skill, strategy, and precision." },
        { "id": "6.3", "name": "VPL", "description": "Valorant Premier League is an esports showdown where teams compete for glory and prizes." },
        { "id": "6.4", "name": "Pro Kickoff Club", "description": "Pro Kickoff Cup is a FIFA gaming competition where players battle for glory in football." },
        { "id": "6.5", "name": "Cookie Run India", "description": "Cookie Run India is a gaming event inspired by the game Cookie Run, testing players' speed and strategy." },
        { "id": "6.6", "name": "Echo Strike", "description": "Echo Strike is a team-based battle royale event where squads compete for victory." },
        { "id": "6.7", "name": "Pitch Perfect", "description": "Pitch Perfect is a virtual cricket gaming tournament where players compete in Real Cricket." }
      ]
    },
    {
      "category": "Literary",
      "events": [
        { "id": "7.1", "name": "Popcorn and Playoffs", "description": "Popcorn and Playoffs is a sports and entertainment quiz with team participation and three exciting rounds." },
        { "id": "7.2", "name": "Just A Minute", "description": "Just A Minute challenges participants to speak on a random topic for a full minute without pausing, repeating, or going off-topic." },
        { "id": "7.3", "name": "VPL", "description": "Valorant Premier League at the college fest is a competitive gaming event with teams vying for the championship." },
        { "id": "7.4", "name": "Opinionated 2.0", "description": "Opinionated is a public speaking competition where participants deliver speeches and engage in rebuttal rounds." },
        { "id": "7.5", "name": "Mehfil-E-Alfaaz", "description": "Mehfil-E-Alfaaz is a poetry competition where participants express emotions through poetry, ghazals, or shayari." }
      ]
    },
    {
      "category": "Photography",
      "events": [
        { "id": "8.1", "name": "Pixel Perfect", "description": "Pixel Perfect is a graphic design competition where participants showcase their design skills." },
        { "id": "8.2", "name": "Dazzled", "description": "Dazzled is a phone photography competition where participants capture campus moments using a specific app." },
        { "id": "8.3", "name": "Impromptu Frames", "description": "Impromptu Frames is an on-spot photography competition where participants capture unique moments across three days." },
        { "id": "8.4", "name": "Page to Picture", "description": "Page to Picture is a competition where filmmakers translate written works into visual storytelling." }
      ]
    },
    {
      "category": "Astronomy",
      "events": [
        { "id": "9.1", "name": "StellarVision", "description": "StellarVision 2.0 invites astronomy enthusiasts to present their visionary ideas related to the wonders of the universe." }
      ]
    }
  ]
  